In [2]:
import pandas as pd

In [11]:
#Creating dataframe form a dictionary
info= {
    "name":["abcd","efgh","ijkl"],
    "age":["12","13","14"]
}

In [20]:
df=pd.DataFrame(info)
df.columns=["Name","Age"]
df

   Name Age
0  abcd  12
1  efgh  13
2  ijkl  14

In [28]:
#Creating a dataframe using list
name=["abcd","efgh","ijkl"]
age=["12","13","14"]
sal=[1200,1300,1400]

In [42]:
dflist=pd.DataFrame(list(zip(name,age,sal)),columns=["Name","Age","Salarry"])
dflist

   Name Age  Salarry
0  abcd  12     1200
1  efgh  13     1300
2  ijkl  14     1400

In [43]:
dflist.loc[0]

Name       abcd
Age          12
Salarry    1200
Name: 0, dtype: object

In [44]:
dflist.iloc[0]

Name       abcd
Age          12
Salarry    1200
Name: 0, dtype: object

In [45]:
dflist.index

RangeIndex(start=0, stop=3, step=1)

In [46]:
dflist.set_index("Name",inplace=True)

In [47]:
dflist.head()

     Age  Salarry
Name
abcd  12     1200
efgh  13     1300
ijkl  14     1400

In [49]:
dflist.iloc[0]

Age          12
Salarry    1200
Name: abcd, dtype: object